rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_COMMON.h
  /* Device specific interrupts */
  INT0_IRQn                    = 0,                /**< CPU to CPU int0 */
  INT1_IRQn                    = 1,                /**< CPU to CPU int1 */
  INT2_IRQn                    = 2,                /**< CPU to CPU int2 */
  INT3_IRQn                    = 3,                /**< CPU to CPU int3 */
  DMATCD0_IRQn                 = 4,                /**< DMA transfer complete and error CH0 */
  DMATCD1_IRQn                 = 5,                /**< DMA transfer complete and error CH1 */
  DMATCD2_IRQn                 = 6,                /**< DMA transfer complete and error CH2 */
  DMATCD3_IRQn                 = 7,                /**< DMA transfer complete and error CH3 */
  DMATCD4_IRQn                 = 8,                /**< DMA transfer complete and error CH4 */
  DMATCD5_IRQn                 = 9,                /**< DMA transfer complete and error CH5 */
  DMATCD6_IRQn                 = 10,               /**< DMA transfer complete and error CH6 */
  DMATCD7_IRQn                 = 11,               /**< DMA transfer complete and error CH7 */
  DMATCD8_IRQn                 = 12,               /**< DMA transfer complete and error CH8 */
  DMATCD9_IRQn                 = 13,               /**< DMA transfer complete and error CH9 */
  DMATCD10_IRQn                = 14,               /**< DMA transfer complete and error CH10 */
  DMATCD11_IRQn                = 15,               /**< DMA transfer complete and error CH11 */
  DMATCD12_IRQn                = 16,               /**< DMA transfer complete and error CH12 */
  DMATCD13_IRQn                = 17,               /**< DMA transfer complete and error CH13 */
  DMATCD14_IRQn                = 18,               /**< DMA transfer complete and error CH14 */
  DMATCD15_IRQn                = 19,               /**< DMA transfer complete and error CH15 */
  DMATCD16_IRQn                = 20,               /**< DMA transfer complete and error CH16 */
  DMATCD17_IRQn                = 21,               /**< DMA transfer complete and error CH17 */
  DMATCD18_IRQn                = 22,               /**< DMA transfer complete and error CH18 */
  DMATCD19_IRQn                = 23,               /**< DMA transfer complete and error CH19 */
  DMATCD20_IRQn                = 24,               /**< DMA transfer complete and error CH20 */
  DMATCD21_IRQn                = 25,               /**< DMA transfer complete and error CH21 */
  DMATCD22_IRQn                = 26,               /**< DMA transfer complete and error CH22 */
  DMATCD23_IRQn                = 27,               /**< DMA transfer complete and error CH23 */
  DMATCD24_IRQn                = 28,               /**< DMA transfer complete and error CH24 */
  DMATCD25_IRQn                = 29,               /**< DMA transfer complete and error CH25 */
  DMATCD26_IRQn                = 30,               /**< DMA transfer complete and error CH26 */
  DMATCD27_IRQn                = 31,               /**< DMA transfer complete and error CH27 */
  DMATCD28_IRQn                = 32,               /**< DMA transfer complete and error CH28 */
  DMATCD29_IRQn                = 33,               /**< DMA transfer complete and error CH29 */
  DMATCD30_IRQn                = 34,               /**< DMA transfer complete and error CH30 */
  DMATCD31_IRQn                = 35,               /**< DMA transfer complete and error CH31 */
  ERM_0_IRQn                   = 36,               /**< Single bit ECC error */
  ERM_1_IRQn                   = 37,               /**< Multi bit ECC error */
  MCM_IRQn                     = 38,               /**< Multi bit ECC error */
  STM0_IRQn                    = 39,               /**< Single interrupt vector for all four channels */
  STM1_IRQn                    = 40,               /**< Single interrupt vector for all four channels */
  STM2_IRQn                    = 41,               /**< Single interrupt vector for all four channels */
  SWT0_IRQn                    = 42,               /**< Platform watchdog initial time-out */
  SWT1_IRQn                    = 43,               /**< Platform watchdog initial time-out */
  SWT2_IRQn                    = 44,               /**< Platform watchdog initial time-out */
  CTI0_IRQn                    = 45,               /**< CTI Interrupt 0 */
  CTI1_IRQn                    = 46,               /**< CTI Interrupt 1 */
  FLASH_0_IRQn                 = 48,               /**< Program or erase operation is completed */
  FLASH_1_IRQn                 = 49,               /**< Main watchdog timeout interrupt */
  FLASH_2_IRQn                 = 50,               /**< Alternate watchdog timeout interrupt */
  RGM_IRQn                     = 51,               /**< Interrupt request to the system */
  PMC_IRQn                     = 52,               /**< One interrupt for all LVDs, One interrupt for all HVDs */
  SIUL_0_IRQn                  = 53,               /**< External Interrupt Vector 0 */
  SIUL_1_IRQn                  = 54,               /**< External Interrupt Vector 1 */
  SIUL_2_IRQn                  = 55,               /**< External Interrupt Vector 2 */
  SIUL_3_IRQn                  = 56,               /**< External Interrupt Vector 3 */
  STM3_IRQn                    = 57,               /**< Single interrupt vector for all four channels */
  SWT3_IRQn                    = 58,               /**< Platform watchdog initial time-out */
  EMIOS0_0_IRQn                = 61,               /**< Interrupt request 23,22,21,20 */
  EMIOS0_1_IRQn                = 62,               /**< Interrupt request 19,18,17,16 */
  EMIOS0_2_IRQn                = 63,               /**< Interrupt request 15,14,13,12 */
  EMIOS0_3_IRQn                = 64,               /**< Interrupt request 11,10,9,8 */
  EMIOS0_4_IRQn                = 65,               /**< Interrupt request 7,6,5,4 */
  EMIOS0_5_IRQn                = 66,               /**< Interrupt request 3,2,1,0 */
  EMIOS1_0_IRQn                = 69,               /**< Interrupt request 23,22,21,20 */
  EMIOS1_1_IRQn                = 70,               /**< Interrupt request 19,18,17,16 */
  EMIOS1_2_IRQn                = 71,               /**< Interrupt request 15,14,13,12 */
  EMIOS1_3_IRQn                = 72,               /**< Interrupt request 11,10,9,8 */
  EMIOS1_4_IRQn                = 73,               /**< Interrupt request 7,6,5,4 */
  EMIOS1_5_IRQn                = 74,               /**< Interrupt request 3,2,1,0 */
  EMIOS2_0_IRQn                = 77,               /**< Interrupt request 23,22,21,20 */
  EMIOS2_1_IRQn                = 78,               /**< Interrupt request 19,18,17,16 */
  EMIOS2_2_IRQn                = 79,               /**< Interrupt request 15,14,13,12 */
  EMIOS2_3_IRQn                = 80,               /**< Interrupt request 11,10,9,8 */
  EMIOS2_4_IRQn                = 81,               /**< Interrupt request 7,6,5,4 */
  EMIOS2_5_IRQn                = 82,               /**< Interrupt request 3,2,1,0 */
  WKPU_IRQn                    = 83,               /**< Interrupts from pad group 0,1,2,3, Interrupts from pad group 0_64, Interrupts from pad group 1_64, Interrupts from pad group 2_64, Interrupts from pad group 3_64 */
  CMU0_IRQn                    = 84,               /**< CMU0 interrupt */
  CMU1_IRQn                    = 85,               /**< CMU1 interrupt */
  CMU2_IRQn                    = 86,               /**< CMU2 interrupt */
  BCTU_IRQn                    = 87,               /**< An interrupt is requested when a conversion is issued to the ADC, An interrupt is requested when new data is available from ADC0 conversion, An interrupt is requested when new data is available from ADC1 conversion, An interrupt is requested when new data is available from ADC2 conversion, An interrupt is requested when the last command of a list is issued to the ADC,An Interrupt output for FIFO1,An Interrupt output for FIFO2 */
  AESAPP0_IRQn                 = 88,               /**< Application 0 interrupt */
  AES_APP1_IRQn                = 89,               /**< Application 1 interrupt */
  AES_APP2_IRQn                = 90,               /**< Application 2 interrupt */
  AES_APP3_IRQn                = 91,               /**< Application 3 interrupt */
  LCU0_IRQn                    = 92,               /**< Interrupt 0, Interrupt 1 Interrupt 2 */
  LCU1_IRQn                    = 93,               /**< Interrupt 0, Interrupt 1 Interrupt 2 */
  AES_APP4_IRQn                = 94,               /**< Application 4 interrupt */
  AES_APP5_IRQn                = 95,               /**< Application 5 interrupt */
  PIT0_IRQn                    = 96,               /**< Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3,Interrupt for Channel4 */
  PIT1_IRQn                    = 97,               /**< Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3 */
  PIT2_IRQn                    = 98,               /**< Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3 */
  PIT3_IRQn                    = 99,               /**< Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3 */
  AES_APP6_IRQn                = 100,              /**< Application 6 interrupt */
  AES_APP7_IRQn                = 101,              /**< Application 7 interrupt */
  RTC_IRQn                     = 102,              /**< RTCF or ROVRF interrupt to be serviced by the system controller, APIF interrupt to be serviced by the system controller */
  FlexCAN0_0_IRQn              = 109,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN0_1_IRQn              = 110,              /**< Message Buffer Interrupt line 0-31,ORed Interrupt for Message Buffers */
  FlexCAN0_2_IRQn              = 111,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN0_3_IRQn              = 112,              /**< Message Buffer Interrupt line 64-95 */
  FlexCAN1_0_IRQn              = 113,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN1_1_IRQn              = 114,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN1_2_IRQn              = 115,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN2_0_IRQn              = 116,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN2_1_IRQn              = 117,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN2_2_IRQn              = 118,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN3_0_IRQn              = 119,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN3_1_IRQn              = 120,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN4_0_IRQn              = 121,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN4_1_IRQn              = 122,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN5_0_IRQn              = 123,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN5_1_IRQn              = 124,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN6_0_IRQn              = 125,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN6_1_IRQn              = 126,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN7_0_IRQn              = 127,              /**< Interrupt indicating that the CAN bus went to Bus Off state */
  FlexCAN7_1_IRQn              = 128,              /**< Message Buffer Interrupt line 0-31 */
  FlexCAN1_3_IRQn              = 129,              /**< Message Buffer Interrupt line 64-95 */
  FlexCAN2_3_IRQn              = 130,              /**< Message Buffer Interrupt line 64-95 */
  FlexCAN3_2_IRQn              = 131,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN4_2_IRQn              = 132,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN5_2_IRQn              = 133,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN6_2_IRQn              = 134,              /**< Message Buffer Interrupt line 32-63 */
  FlexCAN7_2_IRQn              = 135,              /**< Message Buffer Interrupt line 32-63 */
  MU4_A_0_IRQn                 = 136,              /**< ORed TX interrupt to MUA */
  MU4_A_1_IRQn                 = 137,              /**< ORed TX interrupt to MUA */
  MU4_A_2_IRQn                 = 138,              /**< ORed general purpose interrupt request to MUA */
  FLEXIO_IRQn                  = 139,              /**< FlexIO Interrupt */
  LPUART0_IRQn                 = 141,              /**< TX and RX interrupt */
  LPUART1_IRQn                 = 142,              /**< TX and RX interrupt */
  LPUART2_IRQn                 = 143,              /**< TX and RX interrupt */
  LPUART3_IRQn                 = 144,              /**< TX and RX interrupt */
  LPUART4_IRQn                 = 145,              /**< TX and RX interrupt */
  LPUART5_IRQn                 = 146,              /**< TX and RX interrupt */
  LPUART6_IRQn                 = 147,              /**< TX and RX interrupt */
  LPUART7_IRQn                 = 148,              /**< TX and RX interrupt */
  LPUART8_IRQn                 = 149,              /**< TX and RX interrupt */
  LPUART9_IRQn                 = 150,              /**< TX and RX interrupt */
  LPUART10_IRQn                = 151,              /**< TX and RX interrupt */
  LPUART11_IRQn                = 152,              /**< TX and RX interrupt */
  LPUART12_IRQn                = 153,              /**< TX and RX interrupt */
  LPUART13_IRQn                = 154,              /**< TX and RX interrupt */
  LPUART14_IRQn                = 155,              /**< TX and RX interrupt */
  LPUART15_IRQn                = 156,              /**< TX and RX interrupt */
  MU4_B_0_IRQn                 = 157,              /**< ORed TX interrupt to MUB */
  MU4_B_1_IRQn                 = 158,              /**< ORed TX interrupt to MUB */
  MU4_B_2_IRQn                 = 159,              /**< ORed general purpose interrupt request to MUB */
  LPI2C0_IRQn                  = 161,              /**< LPI2C Master Interrupt, LPI2C Interrupt */
  LPI2C1_IRQn                  = 162,              /**< LPI2C Master Interrupt, LPI2C Interrupt */
  LPSPI0_IRQn                  = 165,              /**< LPSPI Interrupt */
  LPSPI1_IRQn                  = 166,              /**< LPSPI Interrupt */
  LPSPI2_IRQn                  = 167,              /**< LPSPI Interrupt */
  LPSPI3_IRQn                  = 168,              /**< LPSPI Interrupt */
  LPSPI4_IRQn                  = 169,              /**< LPSPI Interrupt */
  LPSPI5_IRQn                  = 170,              /**< LPSPI Interrupt */
  GMAC1_Common_IRQn            = 171,              /**< Common interrupt */
  GMAC1_CH0_TX_IRQn            = 172,              /**< Channel0 TX interrupt */
  QSPI_IRQn                    = 173,              /**< TX Buffer Fill interrupt, Transfer Complete / Transaction Finished, RX Buffer Drain interrupt, Buffer Overflow / Underrun interrupt, Serial Flash Communication Error interrupt, All interrupts ORed output */
  SAI0_IRQn                    = 174,              /**< RX interrupt,TX interrupt */
  SAI1_IRQn                    = 175,              /**< RX interrupt,TX interrupt */
  JDC_IRQn                     = 178,              /**< Indicates new data to be read from JIN_IPS register or can be written to JOUT_IPS register */
  ADC0_IRQn                    = 180,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC1_IRQn                    = 181,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  ADC2_IRQn                    = 182,              /**< End of conversion, Error interrupt, Watchdog interrupt */
  LPCMP0_IRQn                  = 183,              /**< Async interrupt */
  LPCMP1_IRQn                  = 184,              /**< Async interrupt */
  LPCMP2_IRQn                  = 185,              /**< Async interrupt */
  MU3_A_0_IRQn                 = 186,              /**< ORed TX interrupt to MUA */
  MU3_A_1_IRQn                 = 187,              /**< ORed TX interrupt to MUA */
  MU3_A_2_IRQn                 = 188,              /**< ORed general purpose interrupt request to MUA */
  FCCU_0_IRQn                  = 189,              /**< Interrupt request(ALARM state) */
  FCCU_1_IRQn                  = 190,              /**< Interrupt request(miscellaneous conditions) */
  STCU_LBIST_MBIST_IRQn        = 191,              /**< Interrupt request(miscellaneous conditions) */
  HSE_MU0_TX_IRQn              = 192,              /**< ORed TX interrupt to MU-0 */
  HSE_MU0_RX_IRQn              = 193,              /**< ORed RX interrupt to MU-0 */
  HSE_MU0_ORED_IRQn            = 194,              /**< ORed general purpose interrupt request to MU-0 */
  HSE_MU1_TX_IRQn              = 195,              /**< ORed TX interrupt to MU-1 */
  HSE_MU1_RX_IRQn              = 196,              /**< ORed RX interrupt to MU-1 */
  HSE_MU1_ORED_IRQn            = 197,              /**< ORed general purpose interrupt request to MU-1 */
  MU3_B_0_IRQn                 = 199,              /**< ORed TX interrupt to MUB */
  MU3_B_1_IRQn                 = 200,              /**< ORed TX interrupt to MUB */
  MU3_B_2_IRQn                 = 201,              /**< ORed general purpose interrupt request to MUB */
  MU_A_0_IRQn                  = 202,              /**< ORed TX interrupt to MUA */
  MU_A_1_IRQn                  = 203,              /**< ORed RX interrupt to MUA */
  MU_A_2_IRQn                  = 204,              /**< ORed general purpose interrupt request to MUA */
  MU_B_0_IRQn                  = 205,              /**< ORed TX interrupt to MUB */
  MU_B_1_IRQn                  = 206,              /**< ORed RX interrupt to MUB */
  MU_B_2_IRQn                  = 207,              /**< ORed general purpose interrupt request to MUB */
  SoC_IRQn                     = 212,              /**< PLL LOL interrupt */
  Core_clk_IRQn                = 213,              /**< Core clock fail CMU reset reaction interrupt */
  SoC2_IRQn                    = 214,              /**< PLL2 LOL interrupt */
  SoC3_IRQn                    = 215,              /**< AIPS_PLAT_CLK_FAIL CMU reset reaction interrupt */
  XRDC_IRQn                    = 216,              /**< XRDC Error Interrupt */
  SoC4_IRQn                    = 217,              /**< HSE_B_CLK_FAIL CMU reset reaction interrupt */
  SoC5_IRQn                    = 219,              /**< CM7_CORE_CLK_FAIL CMU reset reaction interrupt */
  GMAC0_Common_IRQn            = 224,              /**< Common interrupt */
  GMAC0_CH0_TX_IRQn            = 225,              /**< Channel0 TX interrupt */
  GMAC0_CH0_RX_IRQn            = 226,              /**< Channel0 RX interrupt */
  GMAC0_CH1_TX_IRQn            = 227,              /**< Channel1 TX interrupt */
  GMAC0_CH1_RX_IRQn            = 228,              /**< Channel1 RX interrupt */
  GMAC0_CH2_TX_IRQn            = 229,              /**< Channel2 TX interrupt */
  GMAC0_CH2_RX_IRQn            = 230,              /**< Channel2 RX interrupt */
  GMAC0_SIC_IRQn               = 231,              /**< Safety interrupt correctable */
  GMAC0_SIUC_IRQn              = 232,              /**< Safety interrupt un-correctable */
  GMAC1_CH0_RX_IRQn            = 233,              /**< Channel0 RX interrupt */
  GMAC1_CH1_TX_IRQn            = 234,              /**< Channel1 TX interrupt */
  GMAC1_CH1_RX_IRQn            = 235,              /**< Channel1 RX interrupt */
  GMAC1_CH2_TX_IRQn            = 236,              /**< Channel2 TX interrupt */
  GMAC1_CH2_RX_IRQn            = 237,              /**< Channel2 RX interrupt */
  GMAC1_SIC_IRQn               = 238,              /**< Safety interrupt correctable */
  GMAC1_SIUC_IRQn              = 239               /**< Safety interrupt un-correctable */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M7 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M7 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __ICACHE_PRESENT               1         /**< Defines if an ICACHE is present or not */
#define __DCACHE_PRESENT               1         /**< Defines if an DCACHE is present or not */
#define __DTCM_PRESENT                 1         /**< Defines if an DTCM is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */


/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* #if !defined(S32K388_COMMON_H_) */

